# MaterialId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopographySurface..::..MaterialId Property
TopographySurface Class See Also
---
The id of the material applied to this element.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId MaterialId { get; set; }
```

Visual Basic
---
```text
Public Property MaterialId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Remarks
This applies to TopographySurface and SiteSubRegion elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The materialId cannot map to a valid material element. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace